HSTECH_CODES = [
    "00700", # 腾讯控股
    "03690", # 美团-W
    "09988", # 阿里巴巴-SW
    "01810", # 小米集团-W
    "09618", # 京东集团-SW
    "01211", # 比亚迪股份
    "00981", # 中芯国际
    "02015", # 理想汽车-W
    "09999", # 网易-S
    "01024", # 快手-W
    "09888", # 百度集团-SW
    "09961", # 携程集团-S
    "00992", # 联想集团
    "06690", # 海尔智家
    "02382", # 舜宇光学科技
    "00268", # 金蝶国际
    "00285", # 比亚迪电子
    "03888", # 金山软件
    "00241", # 阿里健康
    "09868", # 小鹏汽车-W
    "09866", # 蔚来-SW
    "09626", # 哔哩哔哩-W
    "00772", # 阅文集团
    "00020", # 商汤-W
    "01347", # 华虹半导体
    "00763", # 中兴通讯
    "00300", # 美的集团
    "02013", # 微盟集团
    "00522", # ASMPT (半导体)
    "00136", # 恒腾网络/儒意控股
    "00780", # 同程旅行
    "06680", # 金力永磁W
    "02359", # 药明康德
    "06160", # 百济神州
]

A_STOCK_CODES = [
    "002594", # 比亚迪
    "002050", # 三花智控
    "000977", # 浪潮信息 (浪潮科技)
    "600900", # 长江电力
    "600489", # 中金黄金
    "002885", # 京泉华
    "300676", # 华大基因
]